{
  "publications": [
    {
      "title": "Op-Ed “How federal research funding transformed my path.“ by Ernest Bennin",
      "journal": "Knox News",
      "year": "2026",
      "link": "https://www.knoxnews.com/story/opinion/columnists/2026/01/13/opinion-how-federal-research-funding-transformed-my-path/88147727007/",
      "image": "/data/uploads/img_5266.jpeg",
      "description": "In this op-ed, I share how federal funding transformed my academic path and enabled me to pursue advanced research in catalysis and molecular sensing."
    },
    {
      "title": "Selective Sensing of Nerve Agent Simulant via Dirhodium(II,II) Paddlewheel Complexes Featuring Pendant Hemilabile Thioether Ligands",
      "journal": "ACS Omega",
      "year": "2026",
      "link": "submitted, manuscript ID ao-2025-10394v",
      "image": "",
      "description": "This follow-up study on the untethered rhodium-NLB systems improves the selectivity of rhodium-based probes by introducing thioether ligands tethered to dirhodium complexes. The resulting systems more effectively distinguish between organophosphate simulants in the same G-series, DCP and DCNP, and chemically similar interferents, acetyl chloride, advancing molecular sensing strategies. Combining synthetic chemistry, spectroscopic characterization, and analytical evaluation, including UV-visible studies, mass spectrometry, solubility and stability testing, and interference analysis, this work offers a comprehensive approach that advances our ability to detect and differentiate DCP."
    },
    {
      "title": "Chromogenic detection of the organophosphate nerve agent simulant DCP mediated by rhodium(II,II)paddlewheel complexes.",
      "journal": "ACS Sensors",
      "year": "2024",
      "link": "https://doi.org/10.1021/acssensors.3c01993",
      "description": "This study uses nitrogenous Lewis bases (NLBs) and rhodium paddlewheel complexes to design a chemical probe for detecting diethyl chlorophosphate (DCP), a simulant of G‑series nerve agents. Combining synthetic chemistry, spectroscopic characterization, and analytical evaluation, including UV-visible studies, mass spectrometry, solubility and stability testing, and interference analysis, this work offers a comprehensive approach that advances our ability to detect and differentiate DCP.",
      "image": "/data/uploads/eric_bennin.jpeg"
    },
    {
      "title": "Heavy Metal Pollution Studies of Soil from the Oti-Dompoase Dumpsite in Kumasi. Fine Chemical Engineering",
      "journal": "Fine Chemical Engineering",
      "year": "2024",
      "link": "https://doi.org/10.37256/fce.5220244793",
      "description": "This article investigates how soil at the Oti‑Dompoase dumpsite in Kumasi is contaminated by heavy metals associated with waste disposal, using field sampling and laboratory analysis to quantify pollution levels and potential risks. It evaluates the concentrations of key metals in surface soils and assesses their environmental impact, providing data that can inform monitoring and remediation efforts around the landfill area",
      "image": "/data/uploads/125f3e81-841c-4e18-b92f-a6344b80fa8f.jpeg"
    }
  ],
  "aboutLong": "Ernest Bennin is a Ph.D. candidate at the University of Tennessee, Knoxville. He holds a Bachelor of Science degree in Chemistry from the Kwame Nkrumah University of Science and Technology (KNUST), Ghana. He is an NSF Center for Computer-Assisted Synthesis (NSF-CCAS) trainee, a member of the American Chemical Society (ACS), and NOBCChE. His current research focuses on:\n\nNovel ligand designs (organic synthesis) | Rhodium paddlewheel complex synthesis | Utilization of rhodium paddlewheel complexes in asymmetric catalysis | Development of Rh(II)-based chemical sensors for chromogenic detection of biomolecules.\n",
  "tagline": "Research • Teaching • Outreach • Mentorship",
  "cvFile": "/data/uploads/ernest-bennin-cv.pdf",
  "aboutShort": "Ernest Bennin is a doctoral candidate in chemistry at the University of Tennessee-Knoxville, exploring research at the intersection of ligand design, synthesis, asymmetric catalysis, and chemical probes for poisonous substance detection.",
  "heroSubtitle": "NOBCChE-UTK President | GSA-UTK President | NSF C-CAS Trainee",
  "contactLocation": "Knoxville, TN",
  "publicationsNote": "For a full list of publications, please see my CV or contact me directly.",
  "projects": [
    {
      "title": "Undergraduate project KNUST",
      "description": "As part of my final‑year undergraduate project in the Department of Chemistry at KNUST, I investigated the quality of groundwater used for drinking in the Offinso‑North District of the Ashanti Region of Ghana under the supervision of Prof. Nkansah A. Asantewaah. The study focused on measuring key physicochemical parameters such as pH, electrical conductivity, total dissolved solids, alkalinity, hardness, and turbidity and the levels of selected metals and nutrients in borehole water. Ten borehole samples from different communities were analyzed for Fe, Zn, Mn, Cu, Pb, Cd, chloride, nitrate, sulfate, and phosphate to evaluate their suitability for human consumption. Overall, most measured parameters fell within World Health Organization guideline limits for drinking water, and cadmium and lead were below the analytical detection limits, indicating minimal contamination by these toxic metals. This project strengthened my interest in environmental and water-quality chemistry while providing useful baseline data for local water safety assessment.",
      "image": "/data/uploads/125f3e81-841c-4e18-b92f-a6344b80fa8f.jpeg"
    },
    {
      "title": "Ernest Bennin | B.S in Chemistry",
      "description": "I earned my Bachelor of Science in Chemistry (first class honors; GPA 3.69/4.00) from the Kwame Nkrumah University of Science and Technology (KNUST), where I built a strong foundation in organic, inorganic, physical, and analytical chemistry and gained extensive hands-on laboratory experience. My undergraduate work focused on environmental chemistry. As an open‑minded young chemist, I was less concerned with specializing early than with contributing to science and improving lives, so I remained open to wherever my academic path might lead. This mindset continues to shape my current research interests and long‑term professional goals",
      "image": "/data/uploads/img_0045-copy.jpeg"
    },
    {
      "title": "Teaching Assistant | Chemistry Dept. | KNUST",
      "image": "/data/uploads/f9484962-44aa-47d7-b7fd-58babad3a945.jpeg",
      "description": "At the end of my undergraduate studies at KNUST, I was selected on merit to serve as a teaching assistant, working with distinguished faculty members, including Prof. E. Kwansah, Prof. Osei-Akoto, and Prof. Darko, on both teaching and laboratory activities. This role provided invaluable early exposure to academic mentoring, pedagogy, and practical laboratory management, which strongly aligned with my desire as a young chemist to make a meaningful impact. My service to the department earned me strong letters of recommendation that have significantly shaped my academic trajectory and contributed to the opportunities I enjoy today."
    },
    {
      "title": "Chemistry Debate Judge | Chemistry Department | KNUST",
      "description": "Serving as a chemistry debate judge on ozone layer depletion intensified my appreciation for science communication and critical thinking. With other judges, we evaluated arguments from participating teams on topics such as the chemistry of ozone-depleting substances, atmospheric reactions, and global policy responses, focusing on scientific accuracy, clarity, and real-world relevance. This experience strengthened my ability to assess complex scientific information, give constructive feedback, and engage diverse audiences on environmentally significant issues",
      "image": "/data/uploads/45502a26-5c81-4954-998d-7779e25d3070.jpeg"
    },
    {
      "title": "Mentorship | KNUST",
      "description": "I had the opportunity to mentor undergraduate students during my time at KNUST, guiding them through coursework, laboratory techniques, and early research experiences. This role strengthened my commitment to teaching and mentorship, and it allowed me to support students as they built confidence in their scientific skills and career aspirations.",
      "image": "/data/uploads/1417f941-f46e-4218-a246-2bcafcdf183f.jpeg"
    },
    {
      "title": "FY23 Grad School Fellowship | University of Tennessee",
      "description": "In 2022, I received the FY23 Graduate School Fellowship at the University of Tennessee, Knoxville, to pursue my Ph.D. in chemistry directly after completing my bachelor’s degree. This five‑year award provides sustained support for my graduate studies and research, allowing me to transition seamlessly from undergraduate training into a full‑time research-focused doctoral program. Being selected for this fellowship has affirmed my potential as an emerging scientist and given me the resources and flexibility to focus on impactful, long-term research goals.",
      "image": "/data/uploads/img_0682.jpeg"
    },
    {
      "title": "Darko Research Group",
      "description": "In January 2023, I officially joined the Darko Research Group after successfully completing a synthetic assignment—my first time independently carrying out a full synthesis, given my primarily analytical background. My PI designed this task to assess my potential in a lab that focuses largely on organic and inorganic chemistry, with some analytical instrumentation, and it marked a key turning point in my transition toward synthesis‑driven research.\nMoreover, I met Eric Fussel and Desiree Moore, who were fourth-year PhD students. They were very helpful and made the lab environment welcoming, which made my transition much easier."
    }
  ],
  "research": [
    {
      "title": "Ligand Design ",
      "description": "I design and study dirhodium-based complexes that drive selective chemical reactions and detect harmful organophosphate compounds. By fine‑tuning the ligands that surround these metal centers, my research advances both the creation of valuable chiral chemicals and the development of smart sensors for safer environments.",
      "image": "/data/uploads/img_1790.jpeg"
    },
    {
      "title": "Catalysis and DFT conformational analysis",
      "description": "My research centers on developing heteroleptic dirhodium catalysts designed to enhance asymmetric chemical transformations. I use computational methods, including density functional theory (DFT), to analyze how different ligand conformations influence catalytic performance, guiding the creation of more efficient and selective catalytic systems.",
      "image": "/data/uploads/img_6372.jpeg"
    },
    {
      "title": "Computational Chemistry",
      "description": "My research integrates computational modeling with experimental chemistry to understand and predict chemical reactivity. By interpreting experimental results through theoretical insights, I identify key factors that control reaction outcomes and use this knowledge to design more effective catalysts for selective transformations.",
      "image": "/data/uploads/img_0174.jpeg"
    },
    {
      "title": "Molecular Sensing ",
      "description": "My work focuses on designing transition metal–based chemical probes for the selective detection of biologically relevant molecules. By tuning metal–ligand interactions and electronic properties, I aim to create responsive systems that can recognize and signal the presence of specific biomolecules, advancing applications in chemical sensing, diagnostics, and environmental monitoring.",
      "image": "/data/uploads/img_4355.jpeg"
    }
  ],
  "contactAvailability": "Open to collaborations and speaking opportunities.",
  "contactEmail": "benninerst@gmail.com, ebennin@vols.utk.edu",
  "contactLinkedIn": "https://www.linkedin.com/in/bennin-ernest-24071b28a/",
  "heroTitle": "Ernest BENNIN, 4th Year Ph.D. Candidate |  Catalysis | Sensing"
}
