{
  "publications": [
    {
      "title": "Op-Ed “How federal research funding transformed my path.“ by Ernest Bennin",
      "journal": "Knox News",
      "year": "2026",
      "link": "https://www.knoxnews.com/story/opinion/columnists/2026/01/13/opinion-how-federal-research-funding-transformed-my-path/88147727007/",
      "image": "/data/uploads/img_5266.jpeg",
      "description": "This is an article highlighting how federal funding influenced my academic path, resulting in my involvement in cutting-edge research areas: catalysis and molecular sensing."
    },
    {
      "title": "Selective Sensing of Nerve Agent Simulant via Dirhodium(II,II) Paddlewheel Complexes Featuring Pendant Hemilabile Thioether Ligands",
      "journal": "ACS Omega",
      "year": "2026",
      "link": "submitted, manuscript ID ao-2025-10394v",
      "image": ""
    },
    {
      "title": "Chromogenic detection of the organophosphate nerve agent simulant DCP mediated by rhodium(II,II)paddlewheel complexes.",
      "journal": "ACS Sensors",
      "year": "2024",
      "link": "https://doi.org/10.1021/acssensors.3c01993"
    }
  ],
  "aboutLong": "Ernest Bennin is a Ph.D. candidate at the University of Tennessee, Knoxville. He holds a Bachelor of Science degree in Chemistry from the Kwame Nkrumah University of Science and Technology (KNUST), Ghana. He is a member of the NSF Center for Computer-Assisted Synthesis (NSF-CCAS), the American Chemical Society (ACS), and NOBCChE. His current research focuses on:\n\nNovel ligand designs (organic synthesis) | Rhodium paddlewheel complexes synthesis | Utilization of rhodium paddlewheel complexes in asymmetric catalysis | Development of Rh(II)-based chemical sensors for chromogenic detection of biomolecules\n",
  "tagline": "Research • Teaching • Outreach • Mentorship",
  "cvFile": "/data/uploads/ernest-bennin-cv.pdf",
  "aboutShort": "Ernest Bernin is a doctoral candidate in chemistry at the University of Tennessee-Knoxville, exploring research at the intersection of ligand design, synthesis, asymmetric catalysis, and chemical probes for poisonous substance detection.",
  "heroSubtitle": "NOBNChE-UTK President | GSA-UTK President",
  "contactLocation": "Knoxville, TN",
  "publicationsNote": "For a full list of publications, please see my CV or contact me directly.",
  "projects": [
    {
      "title": "Project / Award Title 1",
      "description": "A brief description of a notable research project or award. Explain the goal, your contribution, and the outcome.",
      "image": ""
    },
    {
      "title": "Project / Award Title 2",
      "description": "A brief description of another significant project or scholarly achievement.",
      "image": ""
    }
  ],
  "research": [
    {
      "title": "Ligand Design ",
      "description": "Designing ligands on dirhodium complexes for asymmetric catalysis and detection of organophosphate nerve agent simulants. ",
      "image": ""
    },
    {
      "title": "Catalysis and DFT conformational analysis",
      "description": "Developing heteroleptic symmetric catalysts for asymmetric catalysis and investigating them with DFT conformational analysis.",
      "image": ""
    },
    {
      "title": "Computational Chemistry",
      "description": "Using modeling to interpret experiments, predict reactivity, and guide catalyst design.",
      "image": ""
    },
    {
      "title": "Molecular Sensing ",
      "description": "Design transition metal-based chemical probes for biomolecule detection ",
      "image": "/data/uploads/img_4355.jpeg"
    }
  ],
  "contactAvailability": "Open to collaborations and speaking opportunities.",
  "contactEmail": "benninerst@gmail.com ebennin@vols.utk.edu",
  "contactLinkedIn": "www.linkedin.com/in/bennin-ernest-24071b28a",
  "heroTitle": "Ernest BENNIN, Ph.D. Candidate"
}
